In [19]:
# Task 1: Creating 03 dataframes and saving in CSV for further tasks

import pandas as pd
import numpy as np

#------------
# Employee dataframe as pre PDF
#------------
 
employee_data = {
    "ID":["A001","A002","A003","A004","A005"],
    "Name": ["John Alter", "Alice Luxumberg", "Tom Sabestine", "Nina Adgra", "Amy Johny"],
    "Gender": ["M", "F", "M", "F", "F"],
    "City": ["Paris", "London", "Berlin", "Newyork", "Madrid"],
    "Age": [25,27,29,31,30]
}
df_employee = pd.DataFrame(employee_data)
# Save Employee to CSV
df_employee.to_csv("Employee.csv", index=False)

#----------
# Seniority Level DataFrame
#----------

seniority_data = {
    "ID": ["A001", "A002", "A003", "A004", "A005"],
    "Designation_Level": [ 2,2,3,2,3]
}
df_seniority= pd.DataFrame(seniority_data)
#Saving Seniority in CSV
df_seniority.to_csv("Seniourity.csv", index=False)

#-----------
#Project DataFrame
#-----------

project_data = {
    "ID": ["A001","A002","A003","A004","A005",
           "A002","A005","A003","A001","A003",
           "A001","A004","A004","A005"],
    "Project": ["Project 1", "Project 2", "Project 3", "Project 4",  "Project 5",
                "Project 6","Project 7", "Project 8", "Project 9", "Project 10",
                "Project 11", "Project 12", "Project 13", "Project 14"],
    "Cost": [1002000,2000000,4500000,5500000, np.nan,
             680000,400000,350000, np.nan,300000,
             2000000,1000000,3000000,200000],
    "Status": ["Finished", "Ongoing", "Finished", "Ongoing", "Finished",
               "Failed", "Finished", "Failed", "Ongoing", "Finished",
               "Failed", "Ongoing", "Finished", "Finished"]
}
df_project = pd.DataFrame(project_data)
#Saving Project in CSV
df_project.to_csv("Project.csv", index=False)

print("Employee DataFrame:")
display(df_employee)

print("\nseniority DataFrame:")
display(df_seniority)

print("\nproject DataFrame:")
display(df_project)

Employee DataFrame:

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

seniority DataFrame:

     ID  Designation_Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

project DataFrame:

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [33]:
#Task 2: Replacing missing values in the cost column of the dataframe "Project" with running average using the for loop.

import pandas as pd
import numpy as np

proj = pd.read_csv("Project.csv")

#Creating a List to keep a trace of non-missing cost values.

seen_costs = []

#Loop through each row in the table.

for i in range (len(proj)):
    cost = proj.loc[i,"Cost"]

    #if Cost is present
    if pd.notna(cost):
        seen_costs.append(cost)

    #if cost is missing but has a previous value, apply running avg and round it to 0
    elif seen_costs:
        running_avg = sum(seen_costs)/len(seen_costs)
        proj.loc[i,"Cost"] = round(running_avg,0)

    #if cost is missing and this is the first row (no previous values)
    else:
        proj.loc[i,"Cost"] = 0

 #Saving this as a Fresh CSV, to keep the original data

display(proj)
proj.to_csv("Project_filled.csv", index=False)
print(" Project_filled.csv saved successfully!")

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2061714.0   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

 Project_filled.csv saved successfully!

In [31]:
# Task 3: Split "First Name" and "Second Name" from the "Name" Column in the Employee Dataframe and Drop the "name Coloum

import pandas as pd

emp = pd.read_csv("Employee.csv")

# Split 'Name' into 'First Name' and 'Last Name'
emp["First Name"] = emp["Name"].apply(lambda x: x.split()[0])                # before the space
emp["Last Name"] = emp["Name"].apply(lambda x: " ".join(x.split()[1:]))     # after the space

# Drop the old 'Name' column
emp = emp.drop(columns=["Name"])

# Display the updated DataFrame
display(emp)

# Save it as a new file so we keep the original safe
emp.to_csv("Employee_split.csv", index=False)
print("Task 3 complete — Employee_split.csv saved successfully!")

     ID Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

Task 3 complete — Employee_split.csv saved successfully!

In [37]:
# TASK 4: Join all three DataFrames into a single Final DataFrame
# Joining them all in using the common column "ID"

import pandas as pd

# Read the 3 CSV files.

emp = pd.read_csv("Employee_split.csv")     # from Task 3
sen = pd.read_csv("Seniourity.csv")          # from Task 1
proj = pd.read_csv("Project_filled.csv")    # from Task 2

# Merging Employee and Seniority on 'ID' first
emp_sen = emp.merge(sen, on="ID", how="left")

# Now merging the above with the Project on 'ID'
Final = proj.merge(emp_sen, on="ID", how="left")

# Reorder the columns to make it look neat
cols_order = ["ID", "First Name", "Last Name", "Gender", "City", "Age",
              "Designation_Level", "Project", "Cost", "Status"]
Final = Final[cols_order]

# Display the final merged DataFrame
display(Final)

# Save the final combined table
Final.to_csv("Final.csv", index=False)
print("Task 4 complete — Final.csv saved successfully!")

,ID,First Name,Last Name,Gender,City,Age,Designation_Level,Project,Cost,Status
0,A001,John,Alter,M,Paris,25,2,Project 1,1002000.0,Finished
1,A002,Alice,Luxumberg,F,London,27,2,Project 2,2000000.0,Ongoing
2,A003,Tom,Sabestine,M,Berlin,29,3,Project 3,4500000.0,Finished
3,A004,Nina,Adgra,F,Newyork,31,2,Project 4,5500000.0,Ongoing
4,A005,Amy,Johny,F,Madrid,30,3,Project 5,3250500.0,Finished
5,A002,Alice,Luxumberg,F,London,27,2,Project 6,680000.0,Failed
6,A005,Amy,Johny,F,Madrid,30,3,Project 7,400000.0,Finished
7,A003,Tom,Sabestine,M,Berlin,29,3,Project 8,350000.0,Failed
8,A001,John,Alter,M,Paris,25,2,Project 9,2061714.0,Ongoing
9,A003,Tom,Sabestine,M,Berlin,29,3,Project 10,300000.0,Finished
10,A001,John,Alter,M,Paris,25,2,Project 11,2000000.0,Failed
11,A004,Nina,Adgra,F,Newyork,31,2,Project 12,1000000.0,Ongoing
12,A004,Nina,Adgra,F,Newyork,31,2,Project 13,3000000.0,Finished
13,A005,Amy,Johny,F,Madrid,30,3,Project 14,200000.0,Finished

Task 4 complete — Final.csv saved successfully!

In [39]:
#Task 5: Adding a 5% bonus to Employees who have finished their projects.

import pandas as pd

# Read the Final.csv file created in Task 4
Final = pd.read_csv("Final.csv")

# Calculate bonus: 5% of Cost if Status == 'Finished', else 0
Final["bonus"] = Final.apply(
    lambda row: row["Cost"] * 0.05 if str(row["Status"]).strip().lower() == "finished" else 0,
    axis=1
)

# Round the bonus to the nearest integer
Final["bonus"] = Final["bonus"].round(0)

# Display the updated DataFrame
display(Final)

# Save the updated file
Final.to_csv("Final_with_bonus.csv", index=False)
print("Task 5 complete — Final_with_bonus.csv saved successfully!")

,ID,First Name,Last Name,Gender,City,Age,Designation_Level,Project,Cost,Status,bonus
0,A001,John,Alter,M,Paris,25,2,Project 1,1002000.0,Finished,50100.0
1,A002,Alice,Luxumberg,F,London,27,2,Project 2,2000000.0,Ongoing,0.0
2,A003,Tom,Sabestine,M,Berlin,29,3,Project 3,4500000.0,Finished,225000.0
3,A004,Nina,Adgra,F,Newyork,31,2,Project 4,5500000.0,Ongoing,0.0
4,A005,Amy,Johny,F,Madrid,30,3,Project 5,3250500.0,Finished,162525.0
5,A002,Alice,Luxumberg,F,London,27,2,Project 6,680000.0,Failed,0.0
6,A005,Amy,Johny,F,Madrid,30,3,Project 7,400000.0,Finished,20000.0
7,A003,Tom,Sabestine,M,Berlin,29,3,Project 8,350000.0,Failed,0.0
8,A001,John,Alter,M,Paris,25,2,Project 9,2061714.0,Ongoing,0.0
9,A003,Tom,Sabestine,M,Berlin,29,3,Project 10,300000.0,Finished,15000.0
10,A001,John,Alter,M,Paris,25,2,Project 11,2000000.0,Failed,0.0
11,A004,Nina,Adgra,F,Newyork,31,2,Project 12,1000000.0,Ongoing,0.0
12,A004,Nina,Adgra,F,Newyork,31,2,Project 13,3000000.0,Finished,150000.0
13,A005,Amy,Johny,F,Madrid,30,3,Project 14,200000.0,Finished,10000.0

In [46]:
# TASK 6: Demote employees by 1 designation level who failed their project, and remove those with a designation of more than 4

import pandas as pd

# Read the latest data from Task 5
Final = pd.read_csv("Final_with_bonus.csv")
sen = pd.read_csv("Seniourity.csv")

# STEP 1️ — Count how many failed projects each employee has
fail_counts = Final[Final["Status"].str.lower() == "failed"].groupby("ID").size().to_dict()
print("Failed project count per employee:", fail_counts)

# STEP 2️ — Set 'ID' as the index to update the seniority table easily
sen = sen.set_index("ID")

# STEP 3️ — For each failed employee, demote by 1 designation level
for emp_id, count in fail_counts.items():
    if emp_id in sen.index:
        sen.loc[emp_id, "Designation_Level"] = sen.loc[emp_id, "Designation_Level"] + count       
       
# STEP 4️ — Remove employees whose designation level is now > 4
sen_after = sen[sen["Designation_Level"] <= 4].reset_index()

# STEP 5️ — Save the updated seniority list
sen_after.to_csv("Seniority_after_demote.csv", index=False)
print("\n Updated Seniority Table saved as Seniority_after_demote.csv")
display(sen_after)

# STEP 6️ — Update the Final table too (keep only remaining employees)
Final_after = Final.merge(sen_after, on="ID", how="inner", suffixes=("", "_updated"))

# Replace the old Designation_Level with the updated one
Final_after = Final_after.drop(columns=["Designation_Level"]).rename(columns={"Designation_Level_updated": "Designation_Level"})

# Save the updated Final table
Final_after.to_csv("Final_after_task6.csv", index=False)
print("\n Final table updated and saved as Final_after_task6.csv")
display(Final_after)

Failed project count per employee: {'A001': 1, 'A002': 1, 'A003': 1}

 Updated Seniority Table saved as Seniority_after_demote.csv

     ID  Designation_Level
0  A001                  3
1  A002                  3
2  A003                  4
3  A004                  2
4  A005                  3

 Final table updated and saved as Final_after_task6.csv

,ID,First Name,Last Name,Gender,City,Age,Project,Cost,Status,bonus,Designation_Level
0,A001,John,Alter,M,Paris,25,Project 1,1002000.0,Finished,50100.0,3
1,A002,Alice,Luxumberg,F,London,27,Project 2,2000000.0,Ongoing,0.0,3
2,A003,Tom,Sabestine,M,Berlin,29,Project 3,4500000.0,Finished,225000.0,4
3,A004,Nina,Adgra,F,Newyork,31,Project 4,5500000.0,Ongoing,0.0,2
4,A005,Amy,Johny,F,Madrid,30,Project 5,3250500.0,Finished,162525.0,3
5,A002,Alice,Luxumberg,F,London,27,Project 6,680000.0,Failed,0.0,3
6,A005,Amy,Johny,F,Madrid,30,Project 7,400000.0,Finished,20000.0,3
7,A003,Tom,Sabestine,M,Berlin,29,Project 8,350000.0,Failed,0.0,4
8,A001,John,Alter,M,Paris,25,Project 9,2061714.0,Ongoing,0.0,3
9,A003,Tom,Sabestine,M,Berlin,29,Project 10,300000.0,Finished,15000.0,4
10,A001,John,Alter,M,Paris,25,Project 11,2000000.0,Failed,0.0,3
11,A004,Nina,Adgra,F,Newyork,31,Project 12,1000000.0,Ongoing,0.0,2
12,A004,Nina,Adgra,F,Newyork,31,Project 13,3000000.0,Finished,150000.0,2
13,A005,Amy,Johny,F,Madrid,30,Project 14,200000.0,Finished,10000.0,3

In [45]:
# TASK 7: Add Mr. or Mrs. to First Name based on Gender, then drop the Gender column

import pandas as pd

# Read the latest file
Final = pd.read_csv("Final_after_task6.csv")

# Add prefix based on Gender
Final["First Name"] = Final.apply(
    lambda row: ("Mr. " + row["First Name"]) if str(row["Gender"]).strip().lower() == "m"
    else ("Mrs. " + row["First Name"]),
    axis=1
)

# Drop the Gender column
Final = Final.drop(columns=["Gender"])

# Display the updated table
display(Final)

# Save the updated version
Final.to_csv("Final_with_titles.csv", index=False)
print("Task 7 complete — Final_with_titles.csv saved successfully!")

,ID,First Name,Last Name,City,Age,Project,Cost,Status,bonus,Designation_Level
0,A001,Mr. John,Alter,Paris,25,Project 1,1002000.0,Finished,50100.0,3
1,A002,Mrs. Alice,Luxumberg,London,27,Project 2,2000000.0,Ongoing,0.0,3
2,A003,Mr. Tom,Sabestine,Berlin,29,Project 3,4500000.0,Finished,225000.0,4
3,A004,Mrs. Nina,Adgra,Newyork,31,Project 4,5500000.0,Ongoing,0.0,2
4,A005,Mrs. Amy,Johny,Madrid,30,Project 5,3250500.0,Finished,162525.0,3
5,A002,Mrs. Alice,Luxumberg,London,27,Project 6,680000.0,Failed,0.0,3
6,A005,Mrs. Amy,Johny,Madrid,30,Project 7,400000.0,Finished,20000.0,3
7,A003,Mr. Tom,Sabestine,Berlin,29,Project 8,350000.0,Failed,0.0,4
8,A001,Mr. John,Alter,Paris,25,Project 9,2061714.0,Ongoing,0.0,3
9,A003,Mr. Tom,Sabestine,Berlin,29,Project 10,300000.0,Finished,15000.0,4
10,A001,Mr. John,Alter,Paris,25,Project 11,2000000.0,Failed,0.0,3
11,A004,Mrs. Nina,Adgra,Newyork,31,Project 12,1000000.0,Ongoing,0.0,2
12,A004,Mrs. Nina,Adgra,Newyork,31,Project 13,3000000.0,Finished,150000.0,2
13,A005,Mrs. Amy,Johny,Madrid,30,Project 14,200000.0,Finished,10000.0,3

✅ Task 7 complete — Final_with_titles.csv saved successfully!

In [47]:
# TASK 8: Promote designation level by 1 if Age > 29 using IF condition

import pandas as pd

# Read the latest dataset
Final = pd.read_csv("Final_with_titles.csv")

# Apply promotion rule using IF condition
Final["Designation_Level"] = Final.apply(
    lambda row: row["Designation_Level"] + 1 if row["Age"] > 29 else row["Designation_Level"],
    axis=1
)

# Display the updated table
display(Final)

# Save the new file
Final.to_csv("Final_after_task8.csv", index=False)
print(" Task 8 complete — Final_after_task8.csv saved successfully!")

,ID,First Name,Last Name,City,Age,Project,Cost,Status,bonus,Designation_Level
0,A001,Mr. John,Alter,Paris,25,Project 1,1002000.0,Finished,50100.0,3
1,A002,Mrs. Alice,Luxumberg,London,27,Project 2,2000000.0,Ongoing,0.0,3
2,A003,Mr. Tom,Sabestine,Berlin,29,Project 3,4500000.0,Finished,225000.0,4
3,A004,Mrs. Nina,Adgra,Newyork,31,Project 4,5500000.0,Ongoing,0.0,3
4,A005,Mrs. Amy,Johny,Madrid,30,Project 5,3250500.0,Finished,162525.0,4
5,A002,Mrs. Alice,Luxumberg,London,27,Project 6,680000.0,Failed,0.0,3
6,A005,Mrs. Amy,Johny,Madrid,30,Project 7,400000.0,Finished,20000.0,4
7,A003,Mr. Tom,Sabestine,Berlin,29,Project 8,350000.0,Failed,0.0,4
8,A001,Mr. John,Alter,Paris,25,Project 9,2061714.0,Ongoing,0.0,3
9,A003,Mr. Tom,Sabestine,Berlin,29,Project 10,300000.0,Finished,15000.0,4
10,A001,Mr. John,Alter,Paris,25,Project 11,2000000.0,Failed,0.0,3
11,A004,Mrs. Nina,Adgra,Newyork,31,Project 12,1000000.0,Ongoing,0.0,3
12,A004,Mrs. Nina,Adgra,Newyork,31,Project 13,3000000.0,Finished,150000.0,3
13,A005,Mrs. Amy,Johny,Madrid,30,Project 14,200000.0,Finished,10000.0,4

 Task 8 complete — Final_after_task8.csv saved successfully!

In [49]:
# TASK 9: Sum the total project cost for each employee

import pandas as pd

# Read the latest dataset
Final = pd.read_csv("Final_after_task8.csv")

# Group by ID and First Name, then sum up the Cost
TotalProjCost = Final.groupby(["ID", "First Name"])["Cost"].sum().reset_index()

# Rename the column
TotalProjCost.rename(columns={"Cost": "Total Cost"}, inplace=True)

# Display the new DataFrame
display(TotalProjCost)

# Save it to a new file
TotalProjCost.to_csv("TotalProjCost.csv", index=False)
print(" Task 9 complete — TotalProjCost.csv saved successfully!")

     ID  First Name  Total Cost
0  A001    Mr. John   5063714.0
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy   3850500.0

 Task 9 complete — TotalProjCost.csv saved successfully!

In [51]:
# TASK 10: Print employees whose city name contains the letter 'o'

import pandas as pd

# Read the latest dataset
Final = pd.read_csv("Final_after_task8.csv")

# Filter employees where city contains 'o' (case-insensitive)
city_with_o = Final[Final["City"].str.contains("o", case=False, na=False)]

# Display the filtered result
display(city_with_o)

# Optional: Save this filtered list
city_with_o.to_csv("Employees_City_with_O.csv", index=False)
print(" Task 10 complete — Employees_City_with_O.csv saved successfully!")

,ID,First Name,Last Name,City,Age,Project,Cost,Status,bonus,Designation_Level
1,A002,Mrs. Alice,Luxumberg,London,27,Project 2,2000000.0,Ongoing,0.0,3
3,A004,Mrs. Nina,Adgra,Newyork,31,Project 4,5500000.0,Ongoing,0.0,3
5,A002,Mrs. Alice,Luxumberg,London,27,Project 6,680000.0,Failed,0.0,3
11,A004,Mrs. Nina,Adgra,Newyork,31,Project 12,1000000.0,Ongoing,0.0,3
12,A004,Mrs. Nina,Adgra,Newyork,31,Project 13,3000000.0,Finished,150000.0,3

 Task 10 complete — Employees_City_with_O.csv saved successfully!

Overview of Data Insights

Following all transformations and analysis, the final dataset can be interpreted as follows:

Following removals and demotions, the company now has five employees actively working on projects.

They oversaw 14 projects in total, costing about ₹26 million (2.6 crore).

Following promotions and demotions, the average designation level is approximately 3, indicating that the majority of employees are mid-level in the hierarchy.

Employee bonuses totalled about ₹900,000, with a 5% bonus given for completed projects.

Mr Tom and Mr John both oversaw projects worth more than ₹5 million each, but Mrs Nina was in charge of the largest overall project cost, which was approximately ₹9.5 million.

Despite managing smaller project portfolios, staff members like Mrs Alice and Mrs Amy consistently produced several "Finished" projects.

Strong employee presence in cities like London and New York (both of which contain the letter "o") points to possible hubs for important projects.

Summary Insight

Overall, the dataset reflects a balanced team where most employees have contributed to multiple projects with reasonable success.
The cost and bonus distribution indicate a healthy mix of completed and ongoing work, while a few failed projects provided opportunities for performance improvement and data-driven personnel adjustments.

Completed Project Report — Python Capstone: Pandas Data Analysis

This project shows how to use Python and the pandas library to clean, transform, and analyse data step-by-step.
The exercises mimic an actual employee-project management situation in which information from various sources is merged, examined, and ready for insights.

Task Summary

Task 1 — Create DataFrames
Three Data Frames were made: Project, Seniority, and Employee. Every table was saved as a distinct CSV file.

Task 2: Address Missing Values
The Project DataFrame's missing cost values were filled in using a for loop and the running average method.

Task 3: Dividing the Name Column
First and last names were separated in the Name column.

Task 4: Combine All Tables
To create a single Final DataFrame, all three DataFrames were combined on ID.

Task 5: Include a Bonus Column
For completed projects, a 5% bonus was computed.

Task 6: Fire Failed Workers
Employees above designation level 4 were dismissed, and those with unsuccessful projects were demoted.

Task 7: Add Titles. The gender column was removed, and the titles "Mr." and "Mrs." were added according to gender.

Task 8: Age-Based Promotion
Workers with more than 29 years of experience received a one-level promotion.

Task 9: Total Project Cost per Worker
Groupby was used to determine the total cost per employee.

Task 10: City Filter displayed the details of every employee whose city name contains the letter "o."

Key Learnings

->DataFrame creation and merging

->Handling missing data

->Conditional logic (if, elif, apply)

->Loops and groupby aggregation

->String operations and CSV file handling.

Conclusion
This capstone project demonstrates the ability to perform end-to-end data processing using Python and pandas, covering data cleaning, transformation, and basic analysis.
The skills practiced here form a strong foundation for real-world data analytics and reporting.